Public Attributes | List of all members
API_AM_VisibilitySettings Struct Reference
Analytical Model
Describes the Analytical Model Visiblity Settings. More...
#include <APIdefs_AnalyticalModel.h>
 Public Attributes
API_AM_VisibilityMode  | visibilityMode = API_AM_VisibilityMode::AnalyticalModelOnly
bool  | isAnalyticalModelVisible = false
bool  | areMembersTransparent = false
bool  | areSymbolsTransparent = false
bool  | areNodesVisible = false
bool  | areReleasesVisible = false
bool  | areCrossSectionsVisible = false
bool  | areCoordinationProfilesVisible = false
bool  | areLocalCoordSystemsVisible = false
API_LoadVisibilityMode  | loadVisibilityMode
Visiblity mode of the Loads in the Analytical Model.
Detailed Description
Describes the Analytical Model Visiblity Settings.
Since
Archicad 26
Member Data Documentation
◆ areCoordinationProfilesVisible
 bool API_AM_VisibilitySettings::areCoordinationProfilesVisible = false
◆ areCrossSectionsVisible
 bool API_AM_VisibilitySettings::areCrossSectionsVisible = false
◆ areLocalCoordSystemsVisible
 bool API_AM_VisibilitySettings::areLocalCoordSystemsVisible = false
◆ areMembersTransparent
 bool API_AM_VisibilitySettings::areMembersTransparent = false
◆ areNodesVisible
 bool API_AM_VisibilitySettings::areNodesVisible = false
◆ areReleasesVisible
 bool API_AM_VisibilitySettings::areReleasesVisible = false
◆ areSymbolsTransparent
 bool API_AM_VisibilitySettings::areSymbolsTransparent = false
◆ isAnalyticalModelVisible
 bool API_AM_VisibilitySettings::isAnalyticalModelVisible = false
◆ loadVisibilityMode
 API_AM_VisibilitySettings::loadVisibilityMode
Visiblity mode of the Loads in the Analytical Model.
◆ visibilityMode
 API_AM_VisibilityMode API_AM_VisibilitySettings::visibilityMode = API_AM_VisibilityMode::AnalyticalModelOnly